app/controllers/artists_controller.rb

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
---
  def new
    @pref = Preference.first_or_create(allow_create_artists: false, allow_create_songs: false)